
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 3 sessions / week for 4 weeks, 1 hour / session\nLabs: 1 session / week for 4 weeks, 3 hours / session\nCourse Objectives This is a fast-paced introductory course to the C++ programming language. It is intended for those with little programming background, though prior programming experience will make it easier, and those with previous experience will still learn C++-specific constructs and concepts.\nBy the end of this course, you should be able to:\nUnderstand and use the basic programming constructs of C/C++ Manipulate various C/C++ datatypes, such as arrays, strings, and pointers Isolate and fix common errors in C++ programs Use memory appropriately, including proper allocation/deallocation procedures Apply object-oriented approaches to software problems in C++ Write small-scale C++ programs using the above skills Course Mechanics You are responsible for all material presented in lectures. There will also generally be some extra notes in the problem sets building on the material that you should read before attempting the problem set. We strongly recommend that you attend labs, as you will almost certainly need help on the problem sets (C++ can be tricky!), but you are not required to stay for the entire lab.\nThere is no textbook for this course. You may find some of the following online materials helpful:\nC++ Language Tutorial\nWikiversity: Introduction to C++\nLearn about C++ Programming\nAssessment There will be four problem sets (the last of which will be smaller) and a final project. You are encouraged to collaborate, but any code and write-ups you hand in must be your own.\nThis is a P/D/F course. Each problem set will be graded out of 100. We will award a pass based on whether problem set grades are generally on par with the class average and whether the final project demonstrates an understanding of the material. There will be no exams.\nCoding Environment Generally, software developers do their development work in some sort of \u0026ldquo;integrated development environment\u0026rdquo; (IDE), which will have many built-in tools for editing, compiling, running, and debugging programs. We recommend that you use the IDE known as Code::Blocks, which is freely available.\nYou will also need to download the GNU C++ compiler (GCC). For Windows machines, you should use the MinGW version of it; you can install the version of Code::Blocks that comes bundled with MinGW, or follow the instructions here. If you\u0026rsquo;re on a Mac, the easiest thing to do is install Xcode, which comes bundled with GCC. Xcode can be downloaded here (registration with Apple is required). If you\u0026rsquo;re using Linux, you probably don\u0026rsquo;t need our help on this one, and your operating system probably came with GCC anyway.\nThere are many IDEs available besides Code::Blocks, and you may use any of them if you so desire. Another freely available one is Eclipse, which is very powerful and works on all operating systems, though many have had technical problems in the past with installing/using it for C++. (We recommend that you download the edition of Eclipse for C/C++ developers, but if you already have a different version of Eclipse, you can install the C/C++ add-ons through Eclipse\u0026rsquo;s add-on manager.) On a Mac, you can simply use the Xcode IDE; on Windows you can use Microsoft Visual Studio on Windows (registration with Microsoft DreamSpark required). While all of these will serve the purpose well, we cannot guarantee that we will be able to help you with any problems that arise in the course of using them.\n"}


